Revit 2027 API
ButtonData.LargeImage Property
The large image of the button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImageSource LargeImage { get; set; }
Public Property LargeImage As ImageSource
	Get
	Set
public:
property ImageSource^ LargeImage {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
member LargeImage : ImageSource with get, set
Property Value
ImageSource
Remarks
The image will be shown on the button in the Ribbon panel if the button is not a part of a stacked set. It will also be shown on a push button added to a pulldown button. The best size is 32 x 32 pixels; if larger, the image will be adjusted to fit the button.
See Also
Reference
ButtonData Class
Autodesk.Revit.UI Namespace